# Pandas assigment

### Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Assign it to a variable called chipo.

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

### See the first 10 entries

In [5]:
# Hint: Use head()
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### See a random 10 lines

In [74]:
# Hint: use sample
chipo.sample(10)

,order_id,quantity,item_name,choice_description,item_price
2944,1170,3,Side of Chips,NaN,$5.07
2566,1016,1,Steak Bowl,"[Fresh Tomato Salsa, [Rice, Pinto Beans, Cheese]]",$9.25
738,304,1,Veggie Soft Tacos,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.25
1400,569,1,Chips,NaN,$2.15
2398,953,1,Barbacoa Burrito,"[Fresh Tomato Salsa, [Rice, Pinto Beans, Chees...",$9.25
2369,943,1,Steak Burrito,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$11.75
3418,1371,2,Canned Soft Drink,[Diet Coke],$2.50
2470,980,1,Side of Chips,NaN,$1.69
3534,1421,1,Chips and Guacamole,NaN,$4.45
1666,674,1,Canned Soft Drink,[Sprite],$1.25

### What is the number of observations in the dataset?

In [9]:
# Hint: use shape 
# Try also using info

print(chipo.shape)
print(chipo.info())

(4622, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

### What is the number of columns in the dataset?

In [10]:
# Hint: use shape
print(chipo.shape[1])

5

### Print the name of all the columns.

In [11]:
# Google is your friend!
print(chipo.columns)

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### How is the dataset indexed?

In [11]:
# Google is your friend!

### Which was the most-ordered item?

In [30]:
print(chipo['item_name'].value_counts().index[0])

Chicken Bowl

### For the most-ordered item, how many items were ordered?

In [31]:
print(chipo['item_name'].value_counts().iloc[0])

726

### How many items were orderd in total?

In [4]:
print(chipo['quantity'].sum())

4972

### Turn the item price into a float

#### a. Check the item price type

In [5]:
# Hint: Use dtype on proper column
chipo['item_price'].dtype

dtype('O')

#### b. Create a lambda function and change the type of item price

In [6]:
# Hint: It can be done by using float() and str.replace, but also in other ways as well
chipo['item_price']=chipo['item_price'].apply(lambda s: float(s[1:]))

#### c. Check the item price type

In [7]:
#Hint: chipo.item_price.dtype
chipo['item_price'].dtype

dtype('float64')

### How much was the revenue for the period in the dataset?

In [62]:
print(chipo['item_price'].sum())

34500.16

### How many orders were made in the period?

In [9]:
print(chipo.order_id.value_counts().shape[0])

1834

### What is the average revenue amount per order?

In [15]:
print(chipo['item_price'].mean())



chipo.groupby('order_id')['item_price'].mean()

7.464335785374397

order_id
1        2.890000
2       16.980000
3        6.335000
4       10.500000
5        6.850000
          ...
1830    11.500000
1831     4.300000
1832     6.600000
1833    11.750000
1834     9.583333
Name: item_price, Length: 1834, dtype: float64

### What is the median revenue amount per order?

In [16]:
print(chipo['item_price'].median())


chipo.groupby('order_id')['item_price'].median()

8.75

order_id
1        2.890
2       16.980
3        6.335
4       10.500
5        6.850
         ...
1830    11.500
1831     2.150
1832     6.600
1833    11.750
1834     8.750
Name: item_price, Length: 1834, dtype: float64

### Describe the revenue per order statistics (Minimium, maximum, mean, median %25 percentile, %75 percentile etc.)

In [84]:
# Hint: Don't work hard! use describe() on proper column!

chipo['item_price'].describe()

count    4622.000000
mean        7.464336
std         4.245557
min         1.090000
25%         3.390000
50%         8.750000
75%         9.250000
max        44.250000
Name: item_price, dtype: float64

## Filtering and Sorting Data

### What is the price of each item?

In [100]:
chipo['item_name'].value_counts()

#chipo.loc[chipo['item_name']=='Barbacoa Salad Bowl']

Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: item_name, dtype: int64

print a data frame with only two columns item_name and item_price

### How many products cost more than $10.00?

In [22]:
print(chipo.loc[chipo['item_price']>10].shape[0])

print(chipo.query('item_price > 10').shape[0])

1130
1130

### Sort by the name of the item

In [106]:
chipo.sort_values(by='item_name')

,order_id,quantity,item_name,choice_description,item_price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],12.98
341,148,1,6 Pack Soft Drink,[Diet Coke],6.49
1849,749,1,6 Pack Soft Drink,[Coke],6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],6.49
2713,1076,1,6 Pack Soft Drink,[Coke],6.49
...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49

### What was the quantity of the most expensive item ordered?

In [26]:
chipo[chipo['item_price']==chipo['item_price'].max()]['quantity']

3598    15
Name: quantity, dtype: int64

### How many times was a Veggie Salad Bowl ordered?

In [39]:
print(chipo[chipo['item_name']=='Veggie Salad Bowl']['quantity'].sum())


print(chipo.query("item_name=='Veggie Salad Bowl'")['quantity'].sum())

18
18

### How many times did someone order more than one Canned Soda?

In [45]:
chipo[(chipo['item_name']=='Canned Soda') & (chipo['quantity']>1)].shape[0]

20

## Grouping

Note: You are about to load a **new dataset**, feel free to get familiar with it before answering the following quesitions

### Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv)  to a "crime" variable

In [81]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv'
    


crime = pd.read_csv(url, sep = ',')

print(crime.columns)
crime.info()
crime.head(20)

Index(['Year', 'Population', 'Total', 'Violent', 'Property', 'Murder',
       'Forcible_Rape', 'Robbery', 'Aggravated_assault', 'Burglary',
       'Larceny_Theft', 'Vehicle_Theft'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     int64
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: int64(12)
memory usage: 5.3 KB

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800
5,1965,193526000,4739400,387390,4352000,9960,23410,138690,215330,1282500,2572600,496900
6,1966,195576000,5223500,430180,4793300,11040,25820,157990,235330,1410100,2822000,561200
7,1967,197457000,5903400,499930,5403500,12240,27620,202910,257160,1632100,3111600,659800
8,1968,199399000,6720200,595010,6125200,13800,31670,262840,286700,1858900,3482700,783600
9,1969,201385000,7410900,661870,6749000,14760,37170,298850,311090,1981900,3888600,878500
10,1970,203235298,8098000,738820,7359200,16000,37990,349860,334970,2205000,4225800,928400
11,1971,206212000,8588200,816500,7771700,17780,42260,387700,368760,2399300,4424200,948200
12,1972,208230000,8248800,834900,7413900,18670,46850,376290,393090,2375500,4151200,887200
13,1973,209851000,8718100,875910,7842200,19640,51400,384220,420650,2565500,4347900,928800
14,1974,211392000,10253400,974720,9278700,20710,55400,442400,456210,3039200,5262500,977100
15,1975,213124000,11292400,1039710,10252700,20510,56090,470500,492620,3265300,5977700,1009600
16,1976,214659000,11349700,1004210,10345500,18780,57080,427810,500530,3108700,6270800,966000
17,1977,216332000,10984500,1029580,9955000,19120,63500,412610,534350,3071500,5905700,977700
18,1978,218059000,11209000,1085550,10123400,19560,67610,426930,571460,3128300,5991000,1004100
19,1979,220099000,12249500,1208030,11041500,21460,76390,480700,629480,3327700,6601000,1112800

crime### What is the most dangerous decade to live in the US?

In [94]:
crime['dangerous']=crime['Year'].apply(lambda x: str(x)[2])
crime.head(20)
#crime[['Year','dangerous']]
crime.groupby('dangerous')['Total'].sum().sort_values()

dangerous
6     49295900
1     50167967
7    100991600
0    115012044
8    131123369
9    136582146
Name: Total, dtype: int64

## Merges and joins

Use the display function defined belowe to print the results of the tables you are joining, side by side

In [58]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [59]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','David'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','Managment']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1','df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

### Create one table with all employee names and data

In [56]:
# Hint: df1.merge?

In [60]:
# Are all the employees really available?

## Add the superviser name to the table of all data

In [61]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [66]:
display('df1','df2','df4')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

## Add skills

In [67]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1','df2','df4','df5')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4    David    Managment

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

### Add skills such that employee names can be duplicated

Results should look like:

In [73]:
# What's the code?

  employee        group  hire_date supervisor        skills
0      Bob   Accounting       2008      Carly          math
1      Bob   Accounting       2008      Carly  spreadsheets
2     Jake  Engineering       2012      Guido        coding
3     Jake  Engineering       2012      Guido         linux
4     Lisa  Engineering       2004      Guido        coding
5     Lisa  Engineering       2004      Guido         linux
6      Sue           HR       2014      Steve  spreadsheets
7      Sue           HR       2014      Steve  organization

### Add skills but keep one row per employee

Results should look like:

In [80]:
# What's the code? 
# Hint: this is more difficult and non standrad. Start by merging all dataframes excluding df5 into a new dataframe, let's call it df6
# use map() on the proper column of df6 and map the result of a proper groupby() and apply() operation on df5

  employee        group  hire_date supervisor                         skils
0      Bob   Accounting       2008      Carly          [math, spreadsheets]
1     Jake  Engineering       2012      Guido               [coding, linux]
2     Lisa  Engineering       2004      Guido               [coding, linux]
3      Sue           HR       2014      Steve  [spreadsheets, organization]

## Merging with "set aritmethic"

The following picture captures the potential way to combined two sets (AKA set aritmethics)

In [84]:
from IPython.display import Image
from IPython.core.display import HTML 
Image(url= "https://www.metabase.com/learn/images/sql-join-types/join-types.png")

In [83]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

### Do an inner join

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an left join, df6 on the left

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an right join, df7 on the right

In [88]:
# Hint: df6.merge? - focuse on the "how" property

### Do an outer join

In [88]:
# Hint: df6.merge? - focuse on the "how" property